<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "cloudfront_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "this-is-a-test"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + include_cookies = false
          + prefix          = "logs"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "this-is-a-test"
          + origin_id           = "this-is-a-test/cloudflow"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_security_group.AutoSecurityGroupSSHBase will be created
  + resource "aws_security_group" "AutoSecurityGroupSSHBase" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroup_SSH"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh to anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.7.0/24",
                  + "10.9.0.0/16",
                  + "10.8.8.123/32",
                  + "10.8.8.156/32",
                  + "10.8.11.7/32",
                  + "31.154.25.138/32",
                ]
              + description      = "ssh incoming"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b132d6143ddd6435",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "AutoSecurityGroup_SSH_123"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.AutoSecurityGroupUnAssignedTest2 will be created
  + resource "aws_security_group" "AutoSecurityGroupUnAssignedTest2" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroupUnAssignedTest2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "UDP 11000 allow"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh allow"
              + from_port        = 11000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 11000
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "#rk65j43po.Acg,mfr$56#@!(){}[]"
              + from_port        = 7080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 7080
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "387-389 allow to me"
              + from_port        = 387
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "7.7.7.7/32",
                ]
              + description      = "ICMP all allow to 7.7.7.7"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = []
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/24",
                  + "10.0.3.0/24",
                  + "10.0.4.0/24",
                ]
              + description      = "UDP_Range_to_SubnetsAndIp"
              + from_port        = 20000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 20124
            },
          + {
              + cidr_blocks      = [
                  + "10.12.14.15/32",
                ]
              + description      = "CMP_IPV6_rules"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmpv6"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "10.7.0.0/16",
                ]
              + description      = "ALL UDP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.9.8.9/32",
                  + "10.11.9.7/32",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "All TCP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "ICMP_Traceroute_to_MyIP"
              + from_port        = 30
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.139/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
        ]
      + name                   = "AutoSecurityGroupUnAssignedTest2_345"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.AutoSecurityGroupUnAssignedTest3 will be created
  + resource "aws_security_group" "AutoSecurityGroupUnAssignedTest3" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroupUnAssignedTest3"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "UDP 11000 allow"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh allow"
              + from_port        = 11000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 11000
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "#rk65j43po.Acg,mfr$56#@!(){}[]"
              + from_port        = 7080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 7080
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "LDAP allow to me"
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "7.7.7.7/32",
                ]
              + description      = "ICMP all allow to 7.7.7.7"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = []
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/24",
                  + "10.0.3.0/24",
                ]
              + description      = "UDP_Range_to_SubnetsAndIp"
              + from_port        = 20000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 20124
            },
          + {
              + cidr_blocks      = [
                  + "10.12.14.15/32",
                ]
              + description      = "CMP_IPV6_rules"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmpv6"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "10.7.0.0/16",
                ]
              + description      = "ALL UDP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.9.8.9/32",
                  + "10.11.9.7/32",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "All TCP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "ICMP_Traceroute_to_MyIP"
              + from_port        = 30
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + name                   = "AutoSecurityGroupUnAssignedTest3_456"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.CommitFailures will be created
  + resource "aws_security_group" "CommitFailures" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroup_CommitFailures"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh to anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = "ssh incoming"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "AutoSecurityGroup_CommitFailures_234"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.devsecops_test will be created
  + resource "aws_security_group" "devsecops_test" {
      + arn                    = (known after apply)
      + description            = "Display devsecops "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.20.30.0/24",
                ]
              + description      = ""
              + from_port        = 7654
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 7655
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "web app"
              + from_port        = 1080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8082
            },
        ]
      + name                   = "devsecops_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cool_application"
        }
      + tags_all               = {
          + "Name" = "cool_application"
        }
      + vpc_id                 = "vpc-12345678"
    }

  # azurerm_network_security_group.example will be created
  + resource "azurerm_network_security_group" "example" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "devsecops-nsg"
      + resource_group_name = "devsecops-resources"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_group.example2 will be created
  + resource "azurerm_network_security_group" "example2" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "acceptanceTestSecurityGroup1"
      + resource_group_name = "devsecops-resources"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "test1234"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "Production"
        }
    }

  # azurerm_network_security_rule.testrules["http"] will be created
  + resource "azurerm_network_security_rule" "testrules" {
      + access                      = "Allow"
      + destination_address_prefix  = "192.168.2.0/24"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "http"
      + network_security_group_name = "devsecops-nsg"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "devsecops-resources"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.testrules["rdp"] will be created
  + resource "azurerm_network_security_rule" "testrules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "rdp"
      + network_security_group_name = "devsecops-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "devsecops-resources"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.testrules["sql"] will be created
  + resource "azurerm_network_security_rule" "testrules" {
      + access                      = "Allow"
      + destination_address_prefix  = "192.168.2.0/24"
      + destination_port_range      = "1433"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "sql"
      + network_security_group_name = "devsecops-nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "devsecops-resources"
      + source_address_prefix       = "SqlManagement"
      + source_port_range           = "*"
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "devsecops-resources"
    }

  # azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "devsecops-resources"
      + virtual_network_name                           = "devsecops-network"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "devsecops-network"
      + resource_group_name = "devsecops-resources"
      + subnet              = (known after apply)
    }

  # google_compute_firewall.disabled-rule will be created
  + resource "google_compute_firewall" "disabled-rule" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "7.7.7.7/32",
        ]
      + direction          = "EGRESS"
      + disabled           = true
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "disabled-rule"
      + network            = "network-with-disabled-rule"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i02-ni-gcp will be created
  + resource "google_compute_firewall" "i02-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i02-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = []
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i04-ni-gcp will be created
  + resource "google_compute_firewall" "i04-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i04-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.i05-ni-gcp will be created
  + resource "google_compute_firewall" "i05-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i05-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "3020",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "3020",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.i13-ni-gcp will be created
  + resource "google_compute_firewall" "i13-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i13-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "135",
              + "139",
              + "445",
              + "593",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i18-ni-gcp will be created
  + resource "google_compute_firewall" "i18-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i18-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "111",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "111",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.o01-ni-gcp will be created
  + resource "google_compute_firewall" "o01-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o01-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.o02-ni-gcp will be created
  + resource "google_compute_firewall" "o02-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o02-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # google_compute_firewall.o03-ni-gcp will be created
  + resource "google_compute_firewall" "o03-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o03-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_firewall.o04-ni-gcp will be created
  + resource "google_compute_firewall" "o04-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o04-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = [
              + "135",
              + "139",
              + "445",
              + "539",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.qa-auto-service-account-rule will be created
  + resource "google_compute_firewall" "qa-auto-service-account-rule" {
      + creation_timestamp      = (known after apply)
      + destination_ranges      = [
          + "0.0.0.0/0",
        ]
      + direction               = "EGRESS"
      + enable_logging          = (known after apply)
      + id                      = (known after apply)
      + name                    = "qa-auto-service-account-rule"
      + network                 = "terraform-network"
      + priority                = 1000
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + target_service_accounts = [
          + "qa-service-account-id@cloudflow-qa-gcp1.iam.gserviceaccount.com",
        ]

      + allow {
          + ports    = [
              + "8888",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.risk-to-rule1 will be created
  + resource "google_compute_firewall" "risk-to-rule1" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "risk-to-rule1"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # google_compute_firewall.risk-to-rule2 will be created
  + resource "google_compute_firewall" "risk-to-rule2" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "risk-to-rule2"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_network.network-with-disabled-rule will be created
  + resource "google_compute_network" "network-with-disabled-rule" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "network-with-disabled-rule"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_service_account.qa_auto_service_account will be created
  + resource "google_service_account" "qa_auto_service_account" {
      + account_id   = "qa-service-account-id"
      + disabled     = false
      + display_name = "QA Auto Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example/tf-test\tmp\tf-test.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example/tf-test\\tmp\\tf-test.out"


```
<br>

</details> <!-- End Format Logs -->


<details>
<summary>Analysis Log</summary>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @VITALYALGOSEC<br>
Action: pull_request<br>
Workflow: Customer Repo CI/CD